==> Load pretrained model form ../pretrained_models/ideal/resnet18fp_imnet.pth.tar ...
Pretrained model accuracy: 69.93189239501953
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,408
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5           [-1, 64, 56, 56]          36,864
       BatchNorm2d-6           [-1, 64, 56, 56]             128
              ReLU-7           [-1, 64, 56, 56]               0
            Conv2d-8           [-1, 64, 56, 56]          36,864
       BatchNorm2d-9           [-1, 64, 56, 56]             128
             ReLU-10           [-1, 64, 56, 56]               0
           Conv2d-11           [-1, 64, 56, 56]          36,864
      BatchNorm2d-12           [-1, 64, 56, 56]             128
             ReLU-13           [-1, 64, 56, 56]               0
           Conv2d-14           [-1, 64, 56, 56]          36,864
      BatchNorm2d-15           [-1, 64, 56, 56]             128
             ReLU-16           [-1, 64, 56, 56]               0
           Conv2d-17          [-1, 128, 28, 28]          73,728
      BatchNorm2d-18          [-1, 128, 28, 28]             256
           Conv2d-19          [-1, 128, 28, 28]           8,192
      BatchNorm2d-20          [-1, 128, 28, 28]             256
             ReLU-21          [-1, 128, 28, 28]               0
             ReLU-22          [-1, 128, 28, 28]               0
           Conv2d-23          [-1, 128, 28, 28]         147,456
      BatchNorm2d-24          [-1, 128, 28, 28]             256
             ReLU-25          [-1, 128, 28, 28]               0
           Conv2d-26          [-1, 128, 28, 28]         147,456
      BatchNorm2d-27          [-1, 128, 28, 28]             256
             ReLU-28          [-1, 128, 28, 28]               0
           Conv2d-29          [-1, 128, 28, 28]         147,456
      BatchNorm2d-30          [-1, 128, 28, 28]             256
             ReLU-31          [-1, 128, 28, 28]               0
           Conv2d-32          [-1, 256, 14, 14]         294,912
      BatchNorm2d-33          [-1, 256, 14, 14]             512
           Conv2d-34          [-1, 256, 14, 14]          32,768
      BatchNorm2d-35          [-1, 256, 14, 14]             512
             ReLU-36          [-1, 256, 14, 14]               0
             ReLU-37          [-1, 256, 14, 14]               0
           Conv2d-38          [-1, 256, 14, 14]         589,824
      BatchNorm2d-39          [-1, 256, 14, 14]             512
             ReLU-40          [-1, 256, 14, 14]               0
           Conv2d-41          [-1, 256, 14, 14]         589,824
      BatchNorm2d-42          [-1, 256, 14, 14]             512
             ReLU-43          [-1, 256, 14, 14]               0
           Conv2d-44          [-1, 256, 14, 14]         589,824
      BatchNorm2d-45          [-1, 256, 14, 14]             512
             ReLU-46          [-1, 256, 14, 14]               0
           Conv2d-47            [-1, 512, 7, 7]       1,179,648
      BatchNorm2d-48            [-1, 512, 7, 7]           1,024
           Conv2d-49            [-1, 512, 7, 7]         131,072
      BatchNorm2d-50            [-1, 512, 7, 7]           1,024
             ReLU-51            [-1, 512, 7, 7]               0
             ReLU-52            [-1, 512, 7, 7]               0
           Conv2d-53            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-54            [-1, 512, 7, 7]           1,024
             ReLU-55            [-1, 512, 7, 7]               0
           Conv2d-56            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-57            [-1, 512, 7, 7]           1,024
             ReLU-58            [-1, 512, 7, 7]               0
           Conv2d-59            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-60            [-1, 512, 7, 7]           1,024
             ReLU-61            [-1, 512, 7, 7]               0
        AvgPool2d-62            [-1, 512, 1, 1]               0
      BatchNorm1d-63                  [-1, 512]           1,024
           Linear-64                   [-1, 10]           5,120
      BatchNorm1d-65                   [-1, 10]              20
       LogSoftmax-66                   [-1, 10]               0
================================================================
Total params: 11,182,676
Trainable params: 11,182,676
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 58.39
Params size (MB): 42.66
Estimated Total Size (MB): 101.62
----------------------------------------------------------------
